<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>pevans</string>
		<key>creation_date</key>
		<date>2019-08-08T12:51:50Z</date>
		<key>munki_version</key>
		<string>3.0.0.3335</string>
		<key>os_version</key>
		<string>10.14.6</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
	</array>
	<key>category</key>
	<string>Software</string>
	<key>description</key>
	<string></string>
	<key>developer</key>
	<string></string>
	<key>display_name</key>
	<string>CreateHubLogs</string>
	<key>installed_size</key>
	<integer>5</integer>
	<key>installer_item_hash</key>
	<string>fba43e33ac5d75823f5150c0f32f6210d2677741c4c135b5f46a75d07debce84</string>
	<key>installer_item_location</key>
	<string>CreateHubLogs-1.0.pkg</string>
	<key>installer_item_size</key>
	<integer>3</integer>
	<key>minimum_os_version</key>
	<string>10.5.0</string>
	<key>name</key>
	<string>CreateHubLogs</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>installed_size</key>
			<integer>5</integer>
			<key>packageid</key>
			<string>com.vmware.workspaceONE.CreateHubLogs</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
	</array>
	<key>unattended_install</key>
	<false/>
	<key>unattended_uninstall</key>
	<false/>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.0</string>
</dict>
</plist>
